@php

    $mockupData = [
        [
            'id' => 1,
            'category' => null,
            'title' => 'Art Aloha " นิทรรศการสุดสร้างสรรค์! เปิดเวทีโชว์ผลงานนักศึกษาวิทยาลัยอาชีวศึกษาธนบุรี',
            'description' => 'วิทยาลัยอาชีวศึกษาธนบุรี เตรียมจัดนิทรรศการ "Art Aloha" งานแสดงผลงานโครงการของนักศึกษาระดับ ปวช.3 และ ปวส.2 ในประเภทวิชาศิลปกรรมและเศรษฐกิจสร้างสรรค์ ซึ่งเป็นเวทีสำคัญสำหรับการนำเสนอผลงานโปรเจกต์จบที่สะท้อนถึงทักษะวิชาชีพและแนวคิดสร้างสรรค์ของนักศึกษา นิทรรศการนี้เปิดโอกาสให้ผู้เข้าชมได้สัมผัสกับผลงานศิลปะที่มีเอกลักษณ์ ทั้งในด้านเทคนิค การออกแบบ การสร้างสรรค์ และแนวคิดที่ตอบโจทย์อุตสาหกรรมสร้างสรรค์ยุคใหม่ โดยงานจะจัดขึ้นในวันที่ 7 มีนาคม 2568 ณ หอศิลป์ C-13 Art Space ขอเชิญชวนผู้ที่สนใจร่วมชมและเป็นกำลังใจให้นักศึกษา พร้อมเปิดมุมมองใหม่ๆ ด้านศิลปะและเศรษฐกิจสร้างสรรค์ในนิทรรศการครั้งนี้',
            'srcImage' => 'images/project/1.jpg',
            'views' => 0,
            'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
            'published_at' => '2025-03-07 10:00:00'
        ],
        [
            'id' => 2,
            'category' => null,
            'title' => 'นิทรรศการ Art ล้างไม้ปั้น พู่กัน และแท่นพิมพ์',
            'description' => '🎨 นิทรรศการ Art ล้างไม้ปั้น พู่กัน และแท่นพิมพ์ 🎨 ขอเชิญทุกท่านร่วมชมนิทรรศการผลงานนักเรียน นักศึกษาสาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี พิธีเปิดนิทรรศการวันพุธที่ 25 กันยายน 2567 เวลา 10.00 น. และนิทรรศการจัดแสดงระหว่างวันที่ 25 กันยายน - 1 ตุลาคม 2567 ณ หอศิลป์ C13 ART SPACE วิทยาลัยอาชีวศึกษาธนบุรี',
            'srcImage' => 'images/project/2.jpg',
            'views' => 0,
            'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
            'published_at' => '2024-09-25 10:00:00'
        ],
        [
            'id' => 3,
            'category' => null,
            'title' => '“Applied art 42 year” นิทรรศการผลงานนักเรียนศิษย์ปัจจุบัน สาขาการออกแบบ',
            'description' => '“Applied art 42 year” นิทรรศการผลงานนักเรียนศิษย์ปัจจุบัน ระดับ ปวช. ชั้นปีที่ 1-3 สาขาวิชาการออกแบบ จัดแสดงผลงานศิษย์ปัจจุบัน ผลงานที่เรียนในรายวิชาสาขาการออกแบบ ภาคเรียนที่ 1 ประจำปีการศึกษา 2567',
            'srcImage' => 'images/project/3.jpg',
            'views' => 0,
            'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
            'published_at' => '2024-08-01 09:00:00'
        ],
        [
            'id' => 4,
            'category' => null,
            'title' => 'Workshop Art Toy',
            'description' => 'ชมรมวิชาชีพวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี ขอเชิญทุกท่านเข้าร่วมกิจกรรม Workshop Art Toy ภายใต้โครงการกิจกรรมส่งเสริมและพัฒนาสมาชิกทางด้านทักษะพื้นฐานการประกวดแข่งขันทักษะพื้นฐาน และโครงการกิจกรรมส่งเสริมศิลปะ ทัศนศิลป์ จิตรกรรม หัตถศิลป์ โดยกิจกรรมจะจัดขึ้นในวันศุกร์ที่ 25 กรกฎาคม 2568 เวลา 13.00 - 16.00 น. ณ หอศิลป์ C13 Art Space วิทยาลัยอาชีวศึกษาธนบุรี',
            'srcImage' => 'images/project/4.jpg',
            'views' => 0,
            'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
            'published_at' => '2025-07-25 13:00:00'
        ],
    ]
    ;
@endphp

<div class="max-w-7xl mx-auto">
    <x-list-showData title="โครงการ" :mockupData="$mockupData" />
</div>