
    @php
    $active     =   'ทั้งหมด';
    $mockupData =[
  [
    'id' => 1,
    'category' => null,
    'title' => 'ผลงานรายวิชาเทคนิคการพิมพ์สกรีนสร้างสรรค์ ระดับปวช.3',
    'description' => 'ผลงานรายวิชาเทคนิคการพิมพ์สกรีนสร้างสรรค์ ระดับปวช. ชั้นปีที่ 3 สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี เชื่อมโยงองค์ความรู้เดิมและประสบการณ์เดิม สู่การเรียนรู้ใหม่ โดยนำนักศึกษานำองค์ความรู้จากรายวิชาภาพพิมพ์สกรีนมาต่อยอดสู่การสร้างสรรค์ผลงานเชิงพาณิชย์ในรายวิชาเทคนิคการพิมพ์สกรีนสร้างสรรค์ โจทย์คือ “การตามหาเนื้อคู่” การออกแบบลายพิมพ์สกรีนให้เข้ากับผลิตภัณฑ์ และออกแบบผลิตภัณฑ์ให้เข้ากับลายพิมพ์สกรีน เข้าบ้างไม่เข้าบ้างแต่พัฒนาต่อไป',
    'srcImage' => 'images/showcase/1.jpg',
    'views' => 80,
    'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
    'published_at' => '2025-02-28'
  ],
  [
    'id' => 2,
    'category' => null,
    'title' => 'ผลงานกระทงสัญลักษณ์ Bangkok River Festival 2024',
    'description' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี สร้างสรรค์กระทงสัญลักษณ์ประจำเทศกาล Bangkok River Festival 2024 โดยได้รับแรงบันดาลใจจากรูปทรงและลวดลายพรรณพฤกษาพระปรางค์วัดอรุณ และรั้วเหล็กกับขนมไข่กุฎีจีนของวัดประยุร ร่วมสืบสานประเพณีลอยกระทงริมสายน้ำเจ้าพระยา ณ งาน Bangkok River Festival 2024 เทศกาลสายน้ำแห่งวัฒนธรรมไทย ปีที่ 10 “ยลสายน้ำ ยินทำนอง” ระหว่างวันที่ 14 - 16 พฤศจิกายน 2567 ณ ท่าน้ำร่วมสมัย วัดอรุณราชวราราม และวัดประยุรวงศาวาส กรุงเทพมหานคร',
    'srcImage' => 'images/showcase/2.jpg',
    'views' => 78,
    'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
    'published_at' => '2024-11-14'
  ],
  [
    'id' => 3,
    'category' => null,
    'title' => 'ผลงานพิมพ์สกรีนสีเดียวด้วยเทคนิค Non-Exposure',
    'description' => 'เส้นคมกริบ! ผลงานชุดแรกจากรายวิชาภาพพิมพ์สกรีน ระดับปวช. ชั้นปีที่ 2 สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี โดยใช้เทคนิคการสร้างแม่พิมพ์สกรีนโดยไม่ใช้แสง (Non-Exposure) ด้วยน้ำยา Varnish ลงบนวัสดุกระดาษและกระเป๋าผ้า สะท้อนบรรยากาศการเรียนรู้และพัฒนาทักษะด้านงานภาพพิมพ์ของนักศึกษา',
    'srcImage' => 'images/showcase/3.jpg',
    'views' => 123,
    'author' => 'สาขาวิชาวิจิตรศิลป์ วิทยาลัยอาชีวศึกษาธนบุรี',
    'published_at' => '2024-07-20'
  ]
];
    @endphp

    <div class="max-w-7xl mx-auto px-4 py-8">
        <x-list-showData 
            title="ผลงานนักเรียน นักศึกษา"
            :mockupData="$mockupData"
        />
    </div>
